import turtle         # <- подключили черепашку

turtle.shape('turtle') # <- нарисовали череашку
turtle.left(90)     # <- сказали черепашке повернуться на лево на 90 градусов

number_of_iterations = 60    # <- Это количество витков спирали
size = 10                    # <- Это размер спирали
step_in_degrees = 122        # <- Тут можешь написать любое число от 1 до 360
                        # интересные 120 90 72 60 51 45 , и близкие к ним числа
                        # Напрпимер 122 118  88 92  70 74  62 58  49 53  43 47
                        # Это градус на который будет поворачиваться черепашка
                        # перед каждым забегом


#-------------------Снизу задание черепашке рисовать спираль---------------------
                        
for  i  in  range(number_of_iterations): # <-этот цикл делает количество витков
    for  j  in  range(0, 360, step_in_degrees):  #<-этот цикл делает один виток
         run_distance=( (i + j/360)*size ) # <-вычисляется по формуле растояние
         turtle.forward(run_distance) # <- черепашка бежит на это растояние
         turtle.left(step_in_degrees) # <- черепашка поворачивается на градус
                                      # который задается сверху
 
